import { UserLanguage } from "./types.user";

export const userAr: UserLanguage = {
    profile: {
        information: {
            fullname: 'البراء سلامة',
            gender: "رجل",
            bio: `مهندس برمجيات متكامل (Full-Stack) حاصل على درجة الماجستير في الأمن السيبراني لدي أكثر من 5 سنوات من الخبرة في بناء ونشر تطبيقات الويب القابلة للتوسع. \n\nأنجزت أكثر من 6 مشاريع شاملة حسّنت من كفاءة الأنظمة ورضا المستخدمين بنسبة تصل إلى 30%. ماهر في بنية الأكواد النظيفة، وتصميم واجهات برمجة التطبيقات (RESTful APIs)، والنشر السحابي (Azure/AWS). \n\nمتعاون قوي أتمتع بشغف لكتابة كود قابل للصيانة وعالي الجودة، وأسعى باستمرار لتبني التقنيات الحديثة لحل التحديات التجارية المعقدة.`
        }
    },
    education: {
        UU: {
            name: 'جامعة اسكودار',
            location: 'اسطنبول، تركيا',
            major: 'الامن السيبراني',
        },
        AAUP: {
            name: 'الجامعة العربية الامريكية',
            location: 'جـنـيـن، فـلـسـطـيـن',
            major: 'هندسة الحاسوب',
        }
    },
    experience: {
        AAUP: {
            name: 'الجامعة العربية الامريكية',
            location: 'جـنـيـن، فـلـسـطـيـن',
            position: 'محاضر',
            achievement: [
                "الإشراف وتوجيه أكثر من 100 طالب بكالوريوس في أساسيات البرمجة وعلوم الحاسوب، مما ساهم في تحسين قدراتهم على حل المشكلات وزيادة ثقتهم في البرمجة.",
                "إدخال ورش عملية في البرمجة ومختبرات لقواعد البيانات."
            ]
        },
        Spinnel: {
            name: 'سـبـيـنـيـل تـكـنـولـوجـي',
            location: 'رام الـلـه، فـلـسـطـيـن',
            position: 'مطور مواقع انترنت متوسط',
            achievement: [
                "تطوير وصيانة وحدات ERP المؤسسية باستخدام ASP.NET Web API و VB.NET Windows Forms، مما ساهم في تحسين كفاءة النظام.",
                "تحسين استعلامات وإجراءات SQL Server المخزنة، مما قلل من أوقات استجابة قاعدة البيانات وضَمِن دقة البيانات عبر وحدات متعددة.",
                "التعاون مع فرق متعددة التخصصات لنشر حلول ERP للعملاء."
            ]
        },
        UATS: {
            name: 'التيمتس للحلول المتكاملة',
            location: 'روابـي، فـلـسـطـيـن',
            position: 'مطور مواقع انترنت مبتدئ',
            achievement: [
                "بناء ونشر تطبيقات ويب باستخدام ASP.NET Web API و HTML5 و CSS3 و JavaScript، مع تسليم أكثر من 5 مشاريع موجهة للعملاء في الوقت المحدد وضمن الميزانية.",
                "تحسين أداء التطبيقات من خلال تحسين استعلامات SQL Server، وممارسات البرمجة النظيفة، وتصميم واجهات برمجة تطبيقات (APIs) فعّالة.",
                "التعاون مع المصممين ومديري المنتجات باستخدام Figma و GitHub لضمان العمل الجماعي السلس وتقليل دورة تطوير البرامج."
            ]
        }
    },
    project: {
       "Static Portfolio": {
            name: 'الصفحة الشخصية الثابتة',
            description: 'موقع بورتفوليو ثابت وخفيف، مصمم لعرض المهارات والخبرات والمشاريع بطريقة بسيطة وأنيقة.',
            
        },
        Portfolio: {
            name: 'الصفحة الشخصية',
            description: 'بورتفوليو ديناميكي وقابل للتخصيص، يتيح لأي شخص عرض مشاريعه وخبراته ومهاراته بميزات حديثة وتفاعلية.',
            
        },
        Aluminum: {
            name: 'المنيوم',
            description: 'حل ويب متكامل مصمم لإدارة أعمال الألمنيوم، بما يشمل المخزون والطلبات وسير العمل، مما يضمن الكفاءة والإدارة السلسة.'
        }
    },
    language: {
        English: {
            name: 'الانجليزية',
            proficiency: 'متقدم'
        },
        Arabic: {
            name: 'العربية',
            proficiency: 'اللغة الام'
        },
        Turkish: {
            name: 'التركية',
            proficiency: 'متقدم'
        },
        Spanish: {
            name: 'الاسبانية',
            proficiency: 'مبتدئ'
        }
    },
    certificate: {
        "AXSOS Academy": {
            name: 'اكاديمية اكسـوس',
            description: 'أكثر من 530 ساعة برمجة في المجموع (أساسيات الويب، هياكل البيانات والخوارزميات، Flask وDjango، Spring Boot، ومكدس MERN).',
            position: 'شهادة مطور مواقع انترنت'
        },
    }
}