import { UserLanguage } from "./types.user";

export const userAr: UserLanguage = {
    profile: {
        information: {
            fullname: 'البراء سلامة',
            gender: "رجل",
            bio: "عملت على مشاريع التجارة الإلكترونية، وأنظمة الـERP، وغيرها عبر شركات مختلفة.\n\nأستمتع ببناء هيكلة التطبيقات وتنظيمها، والتأكد من أن كل شيء مُصمَّم بالطريقة الصحيحة منذ البداية. أحب التفكير في أفضل الطرق لتنظيم الكود وضمان أن يكون التطبيق قابلاً للتوسع وسهل الصيانة على المدى الطويل.\n\nأنا دائمًا أبحث عن طرق للنمو والتطور في هذا المجال. أحب متابعة أحدث التقنيات، وأنا متحمس للاستمرار في التعلّم وخوض تحديات جديدة للارتقاء بمهاراتي."
        }
    },
    education: {
        UU: {
            name: 'جامعة اسكودار',
            location: 'اسطنبول، تركيا',
            major: 'الامن السيبراني',
        },
        AAUP: {
            name: 'الجامعة العربية الامريكية',
            location: 'جـنـيـن، فـلـسـطـيـن',
            major: 'هندسة الحاسوب',
        }
    },
    experience: {
        AAUP: {
            name: 'الجامعة العربية الامريكية',
            location: 'جـنـيـن، فـلـسـطـيـن',
            position: 'محاضر',
        },
        Spinnel: {
            name: 'سـبـيـنـيـل تـكـنـولـوجـي',
            location: 'رام الـلـه، فـلـسـطـيـن',
            position: 'مطور مواقع انترنت متوسط',
        },
        Jawwal: {
            name: 'جـوال',
            location: 'رام الـلـه، فـلـسـطـيـن',
            position: 'سفير',
        },
        UATS: {
            name: 'التيمتس للحلول المتكاملة',
            location: 'روابـي، فـلـسـطـيـن',
            position: 'مطور مواقع انترنت مبتدئ',
        }
    },
    project: {
       "Static Portfolio": {
            name: 'الصفحة الشخصية الثابتة',
            description: 'موقع بورتفوليو ثابت وخفيف، مصمم لعرض المهارات والخبرات والمشاريع بطريقة بسيطة وأنيقة.',
            
        },
        Portfolio: {
            name: 'الصفحة الشخصية',
            description: 'بورتفوليو ديناميكي وقابل للتخصيص، يتيح لأي شخص عرض مشاريعه وخبراته ومهاراته بميزات حديثة وتفاعلية.',
            
        },
        Aluminum: {
            name: 'المنيوم',
            description: 'حل ويب متكامل مصمم لإدارة أعمال الألمنيوم، بما يشمل المخزون والطلبات وسير العمل، مما يضمن الكفاءة والإدارة السلسة.'
        }
    }
}