import { UserLanguage } from "./types.user";

export const userAr: UserLanguage = {
    profile: {
        information: {
            fullname: 'البراء سلامة',
            gender: "رجل",
            bio: "عملت على مشاريع التجارة الإلكترونية، وأنظمة الـERP، وغيرها عبر شركات مختلفة.\n\nأستمتع ببناء هيكلة التطبيقات وتنظيمها، والتأكد من أن كل شيء مُصمَّم بالطريقة الصحيحة منذ البداية. أحب التفكير في أفضل الطرق لتنظيم الكود وضمان أن يكون التطبيق قابلاً للتوسع وسهل الصيانة على المدى الطويل.\n\nأنا دائمًا أبحث عن طرق للنمو والتطور في هذا المجال. أحب متابعة أحدث التقنيات، وأنا متحمس للاستمرار في التعلّم وخوض تحديات جديدة للارتقاء بمهاراتي."
        }
    },
    education: {
        UU: {
            name: 'جامعة اسكودار',
            location: 'اسطنبول، تركيا',
            major: 'الامن السيبراني',
        },
        AAUP: {
            name: 'الجامعة العربية الامريكية',
            location: 'جـنـيـن، فـلـسـطـيـن',
            major: 'هندسة الحاسوب',
        }
    },
    experience: {
        AAUP: {
            name: 'الجامعة العربية الامريكية',
            location: 'جـنـيـن، فـلـسـطـيـن',
            position: 'محاضر',
            responsibility: [
                "إعداد وإلقاء محاضرات في لغات C++ و Python والشبكات وقواعد البيانات لطلبة البكالوريوس.",
                "تطوير المواد الدراسية والواجبات والتمارين العملية بما يتماشى مع متطلبات المنهاج.",
                "إرشاد وتوجيه الطلاب لفهم أساسيات البرمجة وتقنيات حل المشكلات.",
                "تقييم أداء الطلاب من خلال الامتحانات والمشاريع والعروض التقديمية.",
                "متابعة أحدث أساليب التدريس ودمج مختبرات البرمجة العملية في المحاضرات."
            ],
            achievement: [
                "الإشراف وتوجيه أكثر من 100 طالب بكالوريوس في أساسيات البرمجة وعلوم الحاسوب، مما ساهم في تحسين قدراتهم على حل المشكلات وزيادة ثقتهم في البرمجة.",
                "إدخال ورش عملية في البرمجة ومختبرات لقواعد البيانات."
            ]
        },
        Spinnel: {
            name: 'سـبـيـنـيـل تـكـنـولـوجـي',
            location: 'رام الـلـه، فـلـسـطـيـن',
            position: 'مطور مواقع انترنت متوسط',
            responsibility: [
                "تصميم وتطوير وصيانة وحدات ERP باستخدام ASP.NET Web API و VB.NET Windows Forms.",
                "إنشاء وتحسين قواعد بيانات SQL Server والاستعلامات والإجراءات المخزنة لضمان أداء النظام.",
                "المشاركة في جمع المتطلبات وتحليل النظام مع الفرق متعددة التخصصات.",
                "معالجة وإصلاح أخطاء البرمجيات والمشكلات التي أبلغ عنها المستخدمون.",
                "المساعدة في نشر حلول ERP وتقديم الدعم الفني للعملاء."
            ],
            achievement: [
                "تطوير وصيانة وحدات ERP المؤسسية باستخدام ASP.NET Web API و VB.NET Windows Forms، مما ساهم في تحسين كفاءة النظام.",
                "تحسين استعلامات وإجراءات SQL Server المخزنة، مما قلل من أوقات استجابة قاعدة البيانات وضَمِن دقة البيانات عبر وحدات متعددة.",
                "التعاون مع فرق متعددة التخصصات لنشر حلول ERP للعملاء."
            ]
        },
        Jawwal: {
            name: 'جـوال',
            location: 'رام الـلـه، فـلـسـطـيـن',
            position: 'سفير',
            responsibility: [
                "إجراء عمليات تفتيش وتدقيق ميداني لشبكات الألياف الضوئية التي ينفذها الفنيون.",
                "التحقق من الالتزام بمعايير جودة الشبكة وسياسات الشركة.",
                "توثيق نتائج التدقيق وإعداد تقارير لمراجعة الإدارة.",
                "المساعدة في تحسين العمليات الميدانية لتقليل التأخيرات التشغيلية."
            ],
        },
        UATS: {
            name: 'التيمتس للحلول المتكاملة',
            location: 'روابـي، فـلـسـطـيـن',
            position: 'مطور مواقع انترنت مبتدئ',
            responsibility: [
                "تطوير وصيانة تطبيقات الويب باستخدام ASP.NET Web API و HTML5 و CSS3 و JavaScript.",
                "تصميم وتنفيذ قواعد بيانات SQL Server لدعم مشاريع العملاء.",
                "التعاون مع فرق واجهة المستخدم وتجربة المستخدم (UI/UX) باستخدام Figma لتحويل التصاميم إلى تطبيقات عملية.",
                "المشاركة في تخطيط المشاريع، ومراجعات السبرنت، والاجتماعات اليومية لضمان التسليم في الوقت المحدد."
            ],
            achievement: [
                "بناء ونشر تطبيقات ويب باستخدام ASP.NET Web API و HTML5 و CSS3 و JavaScript، مع تسليم أكثر من 5 مشاريع موجهة للعملاء في الوقت المحدد وضمن الميزانية.",
                "تحسين أداء التطبيقات من خلال تحسين استعلامات SQL Server، وممارسات البرمجة النظيفة، وتصميم واجهات برمجة تطبيقات (APIs) فعّالة.",
                "التعاون مع المصممين ومديري المنتجات باستخدام Figma و GitHub لضمان العمل الجماعي السلس وتقليل دورة تطوير البرامج."
            ]
        }
    },
    project: {
       "Static Portfolio": {
            name: 'الصفحة الشخصية الثابتة',
            description: 'موقع بورتفوليو ثابت وخفيف، مصمم لعرض المهارات والخبرات والمشاريع بطريقة بسيطة وأنيقة.',
            
        },
        Portfolio: {
            name: 'الصفحة الشخصية',
            description: 'بورتفوليو ديناميكي وقابل للتخصيص، يتيح لأي شخص عرض مشاريعه وخبراته ومهاراته بميزات حديثة وتفاعلية.',
            
        },
        Aluminum: {
            name: 'المنيوم',
            description: 'حل ويب متكامل مصمم لإدارة أعمال الألمنيوم، بما يشمل المخزون والطلبات وسير العمل، مما يضمن الكفاءة والإدارة السلسة.'
        }
    },
    language: {
        English: {
            name: 'الانجليزية',
            proficiency: 'متقدم'
        },
        Arabic: {
            name: 'العربية',
            proficiency: 'اللغة الام'
        },
        Turkish: {
            name: 'التركية',
            proficiency: 'متقدم'
        },
        Spanish: {
            name: 'الاسبانية',
            proficiency: 'مبتدئ'
        }
    },
    certificate: {
        "AXSOS Academy": {
            name: 'اكاديمية اكسـوس',
            description: 'أكثر من 530 ساعة برمجة في المجموع (أساسيات الويب، هياكل البيانات والخوارزميات، Flask وDjango، Spring Boot، ومكدس MERN).',
            position: 'شهادة مطور مواقع انترنت'
        },
    }
}